In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [2]:
a={"A":"Apple",
                "B":"Ball",
                "C":"Cat",
                "D":"Dog",
                "E":"Elephant",
                "F":"Fan",
                "G":"Glass"}

df=pd.DataFrame({'Letters':[chr(i) for i in range(65,72)],
                 'Words':['Ant','Butter','Chocolate','Donkey',NA,NA,NA]})

In [3]:
a

{'A': 'Apple',
 'B': 'Ball',
 'C': 'Cat',
 'D': 'Dog',
 'E': 'Elephant',
 'F': 'Fan',
 'G': 'Glass'}

In [4]:
mapping=df["Letters"]
df

  Letters      Words
0       A        Ant
1       B     Butter
2       C  Chocolate
3       D     Donkey
4       E        NaN
5       F        NaN
6       G        NaN

In [5]:
df['Mapped']=mapping.map(a)

In [6]:
df

  Letters      Words    Mapped
0       A        Ant     Apple
1       B     Butter      Ball
2       C  Chocolate       Cat
3       D     Donkey       Dog
4       E        NaN  Elephant
5       F        NaN       Fan
6       G        NaN     Glass

In [7]:
ages=np.random.randint(15,60,20).astype(int)
bins=np.array([15,25,35,50,60]).astype(int)
level=["Teen","Adult","Middle Aged","Senior Citizen"]

In [8]:
print(ages)
pd.cut(ages,bins,labels=level)

[37 44 57 53 27 36 43 16 37 55 43 41 52 16 49 32 33 32 15 29]

[Middle Aged, Middle Aged, Senior Citizen, Senior Citizen, Adult, ..., Adult, Adult, Adult, NaN, Adult]
Length: 20
Categories (4, object): [Teen < Adult < Middle Aged < Senior Citizen]

In [9]:
data=np.random.rand(10)
data

array([0.27345837, 0.0332345 , 0.26669152, 0.42850943, 0.28098149,
       0.02518545, 0.92935772, 0.2667116 , 0.14828413, 0.30890203])

In [10]:
print(max(data),min(data))
pd.cut(data,4)

0.929357722007596 0.025185453658311374

[(0.251, 0.477], (0.0243, 0.251], (0.251, 0.477], (0.251, 0.477], (0.251, 0.477], (0.0243, 0.251], (0.703, 0.929], (0.251, 0.477], (0.0243, 0.251], (0.251, 0.477]]
Categories (4, interval[float64]): [(0.0243, 0.251] < (0.251, 0.477] < (0.477, 0.703] < (0.703, 0.929]]

In [11]:
print(pd.cut(data,4,precision=1))
print(pd.cut(data,4,precision=2))
print(pd.cut(data,4,precision=3))
print(pd.cut(data,4,precision=4))
# this precision is used to display number of decimal values

[(0.3, 0.5], (0.02, 0.3], (0.3, 0.5], (0.3, 0.5], (0.3, 0.5], (0.02, 0.3], (0.7, 0.9], (0.3, 0.5], (0.02, 0.3], (0.3, 0.5]]
Categories (4, interval[float64]): [(0.02, 0.3] < (0.3, 0.5] < (0.5, 0.7] < (0.7, 0.9]]
[(0.25, 0.48], (0.024, 0.25], (0.25, 0.48], (0.25, 0.48], (0.25, 0.48], (0.024, 0.25], (0.7, 0.93], (0.25, 0.48], (0.024, 0.25], (0.25, 0.48]]
Categories (4, interval[float64]): [(0.024, 0.25] < (0.25, 0.48] < (0.48, 0.7] < (0.7, 0.93]]
[(0.251, 0.477], (0.0243, 0.251], (0.251, 0.477], (0.251, 0.477], (0.251, 0.477], (0.0243, 0.251], (0.703, 0.929], (0.251, 0.477], (0.0243, 0.251], (0.251, 0.477]]
Categories (4, interval[float64]): [(0.0243, 0.251] < (0.251, 0.477] < (0.477, 0.703] < (0.703, 0.929]]
[(0.2512, 0.4773], (0.02428, 0.2512], (0.2512, 0.4773], (0.2512, 0.4773], (0.2512, 0.4773], (0.02428, 0.2512], (0.7033, 0.9294], (0.2512, 0.4773], (0.02428, 0.2512], (0.2512, 0.4773]]
Categories (4, interval[float64]): [(0.02428, 0.2512] < (0.2512, 0.4773] < (0.4773, 0.7033] < (0.7033, 0.9294]]

In [12]:
import matplotlib.pyplot as pl
data=np.random.randn(1000)
cats=pd.qcut(data,4)

In [13]:
cats

[(-0.0301, 0.687], (-0.668, -0.0301], (0.687, 2.988], (0.687, 2.988], (-3.154, -0.668], ..., (-0.668, -0.0301], (-0.0301, 0.687], (-0.0301, 0.687], (0.687, 2.988], (-0.0301, 0.687]]
Length: 1000
Categories (4, interval[float64]): [(-3.154, -0.668] < (-0.668, -0.0301] < (-0.0301, 0.687] < (0.687, 2.988]]

In [16]:
a=np.random.randn(1000)
np.mean(a).astype(int),np.var(a).astype(int)

(0, 1)

In [87]:
# Detecting and filtering outliers
data=pd.DataFrame(np.random.randint(-10,10,(10,4)))
data.describe()

               0          1          2          3
count  10.000000  10.000000  10.000000  10.000000
mean    1.100000  -1.200000  -5.400000  -4.700000
std     5.858517   6.477311   4.501851   4.620005
min    -9.000000  -9.000000 -10.000000 -10.000000
25%    -1.000000  -7.750000  -8.750000  -7.750000
50%     1.500000   0.000000  -6.500000  -6.000000
75%     5.500000   2.750000  -3.500000  -2.500000
max     8.000000   8.000000   3.000000   5.000000

In [88]:
np.max(data,axis=0),np.max(data,axis=1)

(0    8
 1    8
 2    3
 3    5
 dtype: int32,
 0    8
 1    6
 2    2
 3    7
 4   -7
 5    0
 6    4
 7    8
 8    3
 9    2
 dtype: int32)

In [89]:
col=data[2]
col[np.abs(col)>3]

0   -10
1    -5
4    -7
5    -6
6   -10
7    -8
9    -9
Name: 2, dtype: int32

In [91]:
data

   0  1   2   3
0  8 -2 -10 -10
1  6 -7  -5  -8
2 -1  2  -3  -4
3 -1  7   1  -5
4 -9 -8  -7  -7
5 -7 -9  -6   0
6  4 -8 -10  -9
7  8  8  -8   5
8  3  3   3  -7
9  0  2  -9  -2

In [98]:
np.sign(data)

   0  1  2  3
0  1 -1 -1 -1
1  1 -1 -1 -1
2 -1  1 -1 -1
3 -1  1  1 -1
4 -1 -1 -1 -1
5 -1 -1 -1  0
6  1 -1 -1 -1
7  1  1 -1  1
8  1  1  1 -1
9  0  1 -1 -1

In [101]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))
sampler=np.random.permutation(5)
sampler,df

(array([0, 1, 4, 2, 3]),
     0   1   2   3
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15
 4  16  17  18  19)

In [111]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [ ]:
np